In [7]:
import pandas as pd
import numpy as np
import seaborn as sns
import pingouin as pg

df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [221]:
df[df["alive"] == 'no'].age.mean() - df[df["alive"] == "yes"].age.mean()

2.282489590110604

In [319]:
# 데이터 전체, p-value가 0.05를 넘지 않음
lst_diffAge = []
dead_list = []
alive_list = []

dead = df[df["alive"] == "no"]["age"]
alive = df[df["alive"] == "yes"]["age"]

print(dead.mean() - alive.mean())
pg.ttest(dead, alive, confidence=0.95)

2.282489590110604

,T,dof,alternative,p-val,CI95%,cohen-d,BF10,power
T-test,2.04603,598.841215,two-sided,0.04119,"[0.09, 4.47]",0.157486,0.657,0.541418

In [267]:
# 데이터의 일부, p-value가 0.05를 넘을 때도 있고 안넘을 때도 있음
lst_diffAge = []
dead_list = []
alive_list = []

for _ in range(100):
    sample = df.sample(30, replace=True)
    dead = sample[sample["alive"] == 'no']['age'].mean()
    alive = sample[sample["alive"] == 'yes']['age'].mean()
    
    lst_diffAge.append(dead - alive)
    dead_list.append(dead)
    alive_list.append(alive)

dead = pd.Series(dead_list)
alive = pd.Series(alive_list)

print(dead.mean() - alive.mean())
print(np.percentile(lst_diffAge, 2.5), np.percentile(lst_diffAge, 97.5))
pg.ttest(dead, alive, confidence=0.95)

1.6039641735869097
-10.60788712921066 13.988035714285704

,T,dof,alternative,p-val,CI95%,cohen-d,BF10,power
T-test,2.501516,198,two-sided,0.013177,"[0.34, 2.87]",0.353768,2.797,0.701741

In [44]:
pg.ttest(dead, alive, confidence=0.95)

,T,dof,alternative,p-val,CI95%,cohen-d,BF10,power
T-test,3.135029,198,two-sided,0.00198,"[0.86, 3.79]",0.44336,14.214,0.87694

In [14]:
df_car = pd.read_excel('SL/week3/dataset/car.xlsx')
df_car.head()

   mileage model  price  year  my_car_damage  other_car_damage
0    63608    K3    970  2017              0            564596
1    69336    K3   1130  2015        1839700           1140150
2    36000    K3   1380  2016         446520           2244910
3    19029    K3   1390  2017         889000           4196110
4    97090    K3    760  2015        2339137           2029570

In [20]:
avante = df_car.price[df_car.model == 'Avante']
avante

69     1099
70     1099
71     1099
72      690
73      820
       ...
269     390
270     430
271     390
272     390
273     350
Name: price, Length: 205, dtype: int64

In [222]:
df["embark_lower"] = df["embark_town"].str.lower()
df["embark_lower"].head()

0    southampton
1      cherbourg
2    southampton
3    southampton
4    southampton
Name: embark_lower, dtype: object

In [224]:
df["embark_lower"].str.contains("south")

0       True
1      False
2       True
3       True
4       True
       ...
886     True
887     True
888     True
889    False
890    False
Name: embark_lower, Length: 891, dtype: object

In [225]:
df["embark_lower"].str.contains("south").sum()

644

In [226]:
df["embark_lower"].str.contains("south").count()

889

In [302]:
test_l = [1, 2, 3, 4, 5, 6, 7, 8, 9]

pd.Series(test_l).sample(4, random_state=42)

7    8
1    2
5    6
0    1
dtype: int64